COMMON_ERROR = (
    'В ходе обработки транзации возникла непредвиденная ошибка. '
    'Подробности {error}'
)
DELETE_INVESTED_PROJECT_DISALLOWED = (
    'В проект были внесены средства, не подлежит удалению!'
)
DELETE_USER_DISALLOWED = 'Удаление пользователей запрещено!'
EDIT_CLOSED_PROJECT_DISALLOWED = 'Закрытый проект нельзя редактировать!'
FULL_AMOUNT_MUST_BE_GRATER_INVESTED = (
    'При редактировании проекта должно быть запрещено устанавливать требуемую'
    ' сумму меньше внесённой.'
)
PROJECT_DOES_NOT_EXIST = (
    'Проект сбора пожертвований с указанным {project_id} не существует!'
)
PROJECT_NAME_IS_BUSY = 'Проект с таким именем уже существует!'
